[
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Hey there! We just established the city of Gridlandia, and we hope to get the 5-seat city council going! For that, we need someone to draw up the council districts, and it looks like you could do it!\n\nDon't be shy now, it's actually pretty easy to do!"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "There's 3 main rules that the districts you'll draw need to follow:\n\n1. Each district must have the **same number of people**. Since there are 25 people in Gridlandia, and we want 5 districts for 5 seats, that means **5 people per district**.\n2. Each district must **all be in one piece** -- all the blocks that make up the district must be connected to each other.\n3. Each block in Gridlandia must belong to a district."
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Drawing them is pretty easy: just tap on the blocks in Gridlandia to put them in a district. Tap the button to form the district, and if it meets the rules, you're all set!"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Now, there's 16 blue people and 9 red people in Gridlandia. We want them to all have fair representation, so that means 3 blue districts and 2 red districts -- can you make that happen?\n\nBy the way, you could tap the button above to have an flyover view of Gridlandia!"
    },
    {
        "color": {
            "title": "red"
        },
        "title": "Red Party",
        "text": "Hey... hey! I'm from the Reds, and can you do me a favor -- the reward for you will be great at the end! Can you draw the districts such that *we* would have 3 seats and the Blues 2? The Blues keep on passing things we don't like, and we hope you don't mind if we could stop them from doing that!"
    },
    {
        "color": {
            "title": "red"
        },
        "title": "Red Party",
        "text": "There's two techniques you could try to get this:\n\n1. **Packing** -- pack as much Blues as you can into 1 district; the more blues, the better!\n2. **Cracking** -- spread out as much Reds across multiple districts so that we could win a lot of them by the narrowest margins\n\nIt doesn't matter if a district is won by getting all the votes or by getting just 1 -- it's still one seat in the council anyway!"
    },
    {
        "color": {
            "title": "red"
        },
        "title": "Red Party",
        "text": "So... about that favor... can you do it? Don't forget cracking and packing!"
    },
    {
        "color": {
            "title": "blue"
        },
        "title": "Blue Party",
        "text": "Hey there... I'm from the Blues, and can you do me a favor -- the reward for you will be great at the end? Can you draw the districts such that we'll have 4 and the Reds only 1? I know we're only meant to have 3 seats, but we need 4 to pass laws easily without the Reds trying to block it! They're pretty pesky."
    },
    {
        "color": {
            "title": "blue"
        },
        "title": "Blue Party",
        "text": "Anyway, there's techniques about this -- Packing and Cracking -- but I'm too lazy to explain it here; I'm sure you're smart enough to do this, right?"
    },
    {
        "color": {
            "title": "blue"
        },
        "title": "BLue Party",
        "text": "So... about that favor... can you do it?"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Woah... what happened to the districts? Did you do this? How did the Reds win? How did the Blue majority grow so big?"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Welp, I guess that's just the power of the person holding the pen to draw the districts. It could be done unfairly if it ends up at the wrong person, huh? Hope you, wherever you live, make sure that the person who draws your districts don't use it to their advantage -- and if they do, call them out on it! Don't let them gerrymander!"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "By the way, some other cities need some help with their districts, and I bet you could help with that with what you know! Try it out!"
    },
    {
        "color": {
            "title": "black"
        },
        "title": "Gridlandia Official",
        "text": "Let's look at some of them!"
    }
]
